In [1]:
import pandas as pd

In [2]:
file=pd.read_csv(r"C:\Users\Hassan Ali\OneDrive\Desktop\python\Pandas (practice)\weather.csv")
file

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

two you can use for fetching for data 
excel file
dictionary type code

this is the method for checking
rows and columns in our dataframe

In [3]:
rows,columns=file.shape

In [4]:
columns

4

In [5]:
rows

9

head()show some intial values

In [6]:
file.head()

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83

In [8]:
 file.tail(1)

       date     city  temperature  humidity
8  5/3/2017  beijing           79        35

In [9]:
file.columns

Index(['date', 'city', 'temperature', 'humidity'], dtype='object')

you check every columns in our data frame so 
# we can get the column names

you check the specify city columns data

In [13]:

file['city']

0    new york
1    new york
2    new york
3      mumbai
4      mumbai
5      mumbai
6     beijing
7     beijing
8     beijing
Name: city, dtype: object

and check the columns type so do this

In [14]:
type(file['city'])

pandas.core.series.Series

In [17]:
 file['temperature'].max()
 file['temperature'].min()
 file['temperature'].std()

np.float64(6.424778422465462)

describe show statistical type data 
describe is better appraoch to 
know the mean , min ,max

In [18]:
file.describe()

       temperature   humidity
count     9.000000   9.000000
mean     74.444444  57.000000
std       6.424778  22.841848
min      65.000000  26.000000
25%      68.000000  35.000000
50%      77.000000  58.000000
75%      79.000000  80.000000
max      82.000000  85.000000

In [21]:
file[file.temperature> 45]

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [25]:
file[['date','city']][file.temperature==file['temperature'].max()]

       date    city
5  5/3/2017  mumbai

In [26]:
file.index

RangeIndex(start=0, stop=9, step=1)

In [28]:
file.set_index("date")

              city  temperature  humidity
date
5/1/2017  new york           65        56
5/2/2017  new york           66        58
5/3/2017  new york           68        60
5/1/2017    mumbai           75        80
5/2/2017    mumbai           78        83
5/3/2017    mumbai           82        85
5/1/2017   beijing           80        26
5/2/2017   beijing           77        30
5/3/2017   beijing           79        35

In [29]:
file

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [30]:
file.reset_index(inplace=True)

In [31]:
file

   index      date      city  temperature  humidity
0      0  5/1/2017  new york           65        56
1      1  5/2/2017  new york           66        58
2      2  5/3/2017  new york           68        60
3      3  5/1/2017    mumbai           75        80
4      4  5/2/2017    mumbai           78        83
5      5  5/3/2017    mumbai           82        85
6      6  5/1/2017   beijing           80        26
7      7  5/2/2017   beijing           77        30
8      8  5/3/2017   beijing           79        35